# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'nvm' # Node Version Manager
brew 'pyenv' # Python Version Manager
brew 'zsh-autosuggestions' # Fish-like autosuggestions
brew 'zsh-syntax-highlighting' # Syntax highlighting for zsh

# Development
# Note: If using Herd, you don't need these PHP/MySQL/Nginx packages
# Uncomment if you prefer Homebrew-managed versions instead of Herd
# brew 'php'
# brew 'mysql'
# brew 'nginx'
brew 'composer'
brew 'imagemagick'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'appcleaner'
cask 'cyberduck'
cask 'docker'
cask 'google-chrome'
cask 'herd' # Laravel Herd - PHP development environment
cask 'imageoptim'
cask 'iterm2'
cask 'raycast'
cask 'spotify'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webp-quicklook'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
